
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реализация";
	КомандаПечати.Представление = НСтр("ru = 'Реализация'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр);
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Реализация") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"Реализация",
		НСтр("ru = 'Реализация'"),
		СформироватьПечатнуюФормуЗаписьКлиента(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.Реализация.ПФ_MXL_Реализация");
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

# Область СлужебныеПроцедурыИФункции

Функция СформироватьПечатнуюФормуЗаписьКлиента(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Номер КАК Номер,
	|	Реализация.Дата КАК Дата,
	|	Реализация.Организация КАК Организация,
	|	Реализация.ДокументОснование КАК ДокументОснование,
	|	Реализация.Контрагент КАК Контрагент,
	|	Реализация.Договор КАК Договор,
	|	Реализация.Сотрудник КАК Сотрудник,
	|	Реализация.Склад КАК Склад,
	|	Реализация.СуммаДокумента КАК СуммаДокумента,
	|	Реализация.Ссылка КАК Ссылка,
	|	Реализация.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	Реализация.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЗаписьКлиента";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Реализация.ПФ_MXL_Реализация");
	
	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	УслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	Услуги = Макет.ПолучитьОбласть("Услуги");
	НоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
	Номенклатура = Макет.ПолучитьОбласть("Номенклатура");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока Выборка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Заголовок.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Заголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Шапка);
		
		ВыборкаНоменклатуры = Выборка.Товары.Выбрать();
		Если ВыборкаНоменклатуры.Количество() Тогда
			ТабличныйДокумент.Вывести(НоменклатураШапка);
			Пока ВыборкаНоменклатуры.Следующий() Цикл
				Номенклатура.Параметры.Заполнить(ВыборкаНоменклатуры);
				ТабличныйДокумент.Вывести(Номенклатура);
			КонецЦикла;
		КонецЕсли;
		
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		Если ВыборкаУслуги.Количество() Тогда
			ТабличныйДокумент.Вывести(УслугиШапка);
			Пока ВыборкаУслуги.Следующий() Цикл
				Услуги.Параметры.Заполнить(ВыборкаУслуги);
				ТабличныйДокумент.Вывести(Услуги);
			КонецЦикла;
		КонецЕсли;
		
		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.ГлавныйБухгалтер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Организация,"ГлавныйБухгалтер");
		Подвал.Параметры.Руководитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Организация,"Руководитель");
		ТабличныйДокумент.Вывести(Подвал);
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти