
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредварительнаяЗапись") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Клиент;
		Комментарий = "Введен на основании: Предварительная запись №"+ДанныеЗаполнения.Номер+" от "+ДанныеЗаполнения.Дата;
		Организация = ДанныеЗаполнения.Организация;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Услуга = ТекСтрокаУслуги.Услуга;
			НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОрганизацияИКонтрагентБСП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"Дата,Организация,Контрагент,Сотрудник,Склад,ДокументОснование,СуммаДокумента");
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.ТоварыНаСкладах.Записать();
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Товар,
	|	СУММА(РеализацияТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслуги.Услуга,
	|	СУММА(РеализацияУслуги.Количество),
	|	СУММА(РеализацияУслуги.Сумма)
	|ИЗ
	|	Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|	РеализацияУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияУслуги.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Товар КАК Товар,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Товар.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоТовар,
	|	ВТ_Товары.Товар.Представление КАК ТоварПредставление,
	|	ВТ_Товары.Количество КАК КоличествоВДокументе,
	|	ВТ_Товары.Сумма КАК СуммаВДокументе,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ВТ_Товары.Товар.СтатьяЗатрат КАК ТоварСтатьяЗатрат,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&МоментВремени,
	|				Склад = &Склад
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							Т.Товар
	|						ИЗ
	|							ВТ_Товары КАК Т)) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Товары.Товар = ТоварыНаСкладахОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Товары.Товар,
	|	ВТ_Товары.Товар.Представление,
	|	ВТ_Товары.Количество,
	|	ВТ_Товары.Сумма,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток,
	|	ТоварыНаСкладахОстатки.СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ВТ_Товары.Товар.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВТ_Товары.Товар.СтатьяЗатрат,
	|	ТоварыНаСкладахОстатки.Номенклатура
	|ИТОГИ
	|	МАКСИМУМ(КоличествоВДокументе),
	|	МАКСИМУМ(СуммаВДокументе),
	|	СУММА(КоличествоОстаток)
	|ПО
	|	ТоварСтатьяЗатрат,
	|	Товар";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТоварСтатьяЗатрат = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТоварСтатьяЗатрат.Следующий() Цикл
		
		СтоимостьТоваровОбщая = 0;
		
		ВыборкаТовары = ВыборкаТоварСтатьяЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТовары.Следующий() Цикл
			Если ВыборкаТовары.ЭтоТовар Тогда
				
				ВыборкаТоварыДетальные = ВыборкаТовары.Выбрать();
				
				Превышение = ВыборкаТовары.КоличествоВДокументе - ВыборкаТовары.КоличествоОстаток;
				Если Превышение > 0 Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Внимание. Превышение остатка по номенклатуре ""%1""  в количестве ""%2""", ВыборкаТовары.ТоварПредставление, Превышение);;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;
				
				Пока ВыборкаТоварыДетальные.Следующий() Цикл
					Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
					Движение.Период = ОрганизацияИКонтрагентБСП.Дата;
					Движение.Организация = ОрганизацияИКонтрагентБСП.Организация;
					Движение.Номенклатура = ВыборкаТоварыДетальные.Товар;
					Движение.Склад = ОрганизацияИКонтрагентБСП.Склад;
					Движение.Количество = ВыборкаТоварыДетальные.КоличествоВДокументе;
					Движение.Сумма = ВыборкаТоварыДетальные.СуммаВДокументе;
					СтоимостьТоваровОбщая = СтоимостьТоваровОбщая + Движение.Сумма;
					
					Движение = Движения.Хозрасчетный.Добавить();
					Движение.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
					Движение.СчетКт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаТоварыДетальные.Товар,"СчетбухгалтерскогоУчета");
					Движение.Период = ОрганизацияИКонтрагентБСП.Дата;
					Движение.Сумма = ВыборкаТоварыДетальные.СуммаВДокументе;
					Движение.Содержание = "Списана себестоимость товарно-материальных ценностей";
					БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт,ВыборкаТоварыДетальные.Товар);
				КонецЦикла;
				
			КонецЕсли;
			Движения.Продажи.Записывать = Истина;
			Движение = Движения.Продажи.Добавить();
			Движение.Период = ОрганизацияИКонтрагентБСП.Дата;
			Движение.Организация = ОрганизацияИКонтрагентБСП.Организация;
			Движение.Номенклатура = ВыборкаТовары.Товар;
			Движение.Сотрудник = ОрганизацияИКонтрагентБСП.Сотрудник;
			Движение.Контрагент = ОрганизацияИКонтрагентБСП.Контрагент;
			Движение.Количество = ВыборкаТовары.КоличествоВДокументе;
			Движение.Сумма = ВыборкаТовары.СуммаВДокументе;
		КонецЦикла;
		Если СтоимостьТоваровОбщая > 0 Тогда
			Движение = Движения.УчетЗатрат.Добавить();
			Движение.Период = ОрганизацияИКонтрагентБСП.Дата;
			Движение.Организация = ОрганизацияИКонтрагентБСП.Организация;
			Движение.СтатьяЗатрат = ВыборкаТоварСтатьяЗатрат.ТоварСтатьяЗатрат;
			Движение.Сумма = СтоимостьТоваровОбщая;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Движения.ЗаказыКлиентов.Записывать = Истина;
		Движение = Движения.ЗаказыКлиентов.Добавить();
		Движение.Период = ОрганизацияИКонтрагентБСП.Дата;
		Движение.Организация = ОрганизацияИКонтрагентБСП.Организация;
		Движение.Клиент = ОрганизацияИКонтрагентБСП.Контрагент;
		Движение.ЗаказКлиента = ОрганизацияИКонтрагентБСП.ДокументОснование;
		Движение.Сумма = Услуги.Итог("Сумма");
	КонецЕсли;
	
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
	Движение.Период = ОрганизацияИКонтрагентБСП.Дата;
	Движение.Сумма = ОрганизацияИКонтрагентБСП.СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, ОрганизацияИКонтрагентБСП.Контрагент);
	
КонецПроцедуры
