
&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	//Вызываем расчет сумм ТЧ и заполняем сумму документа
	РаботаСТЧ.ПересчитатьСуммуВСтрокеТЧ(Элементы.Услуги.ТекущиеДанные);
	РаботаСТЧ.ЗаполнитьСуммуДокумента(,Объект.Услуги.Итог("Сумма"),Объект.СуммаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	//Вызываем расчет сумм ТЧ и заполняем сумму документа
	РаботаСТЧ.ПересчитатьСуммуВСтрокеТЧ(Элементы.Услуги.ТекущиеДанные);
	РаботаСТЧ.ЗаполнитьСуммуДокумента(,Объект.Услуги.Итог("Сумма"),Объект.СуммаДокумента);
	
КонецПроцедуры

&НаСервере
Процедура УслугиУслугаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ДатаЗаписи)Тогда
		ОбщаяДлительностьВМинутах = 0;
		Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
			ВремяТекущейНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Услуга, "ДлительностьУслуги");
			ОбщаяДлительностьВМинутах = ОбщаяДлительностьВМинутах + ВремяТекущейНоменклатуры;
		КонецЦикла;
	КонецЕсли;
	Объект.ДатаОкончанияЗаписи = Объект.ДатаЗаписи + (ОбщаяДлительностьВМинутах * 60);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаУслуги = Элементы.Услуги.ТекущиеДанные;
	СтрокаУслуги.Цена = РаботаСЦенами.ПолучитьЗаписьЦеныНаКонкретнуюДату(СтрокаУслуги.Услуга,,Объект.Дата);
	УслугиУслугаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	//Заполняем ответственного через функцию БСП
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры





