Функция getUsers(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	ЗапросПользователи = Новый Запрос;
	ЗапросПользователи.УстановитьПараметр("Наименование", Логин);
	ЗапросПользователи.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.ПользовательМП КАК Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.ПользовательМП = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	
	ПользовательНайден = Не РезультатЗапроса.Пустой();
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("user",ПользовательНайден);
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	
	Возврат Ответ;
	
КонецФункции


