//Заполняет сумму ТЧ
//Необходимо передать один параметр
//Параметр - Элементы.ЛюбаяТЧ(должна иметь колонки Количество и Цену).ТекущиеДанные
&НаКлиенте
Процедура ПересчитатьСуммуВСтрокеТЧ(СтрокаТЧ) Экспорт
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена*СтрокаТЧ.Количество;
	
КонецПроцедуры

//Заполняет сумму документа
//Необходимо передать оди или два параметра ТЧ и Объект.СуммаДокумента
//1 параметр - Объект.Товары.Итог("Сумма") (по умолчанию имеет значение 0)
//2 параметр - Объект.Услуги.Итог("Сумма") (по умолчанию имеет значение 0)
//3 параметр - Объект.СуммаДокумента
&НаКлиенте
Процедура ЗаполнитьСуммуДокумента (Товары = 0, Услуги = 0,СуммаДокумента) Экспорт
	
	СуммаДокумента = Товары + Услуги;
	
КонецПроцедуры 