&НаКлиенте
Процедура УстановитьЗаголовокИВидимость()
	
	ЭтоКлиент = (Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент"));
	Элементы.ДатаРожденияКлиента.Видимость = ЭтоКлиент;
	Элементы.ПолКлиента.Видимость = ЭтоКлиент;
	Если ЭтоКлиент Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О.";
	Иначе
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли;
	Элементы.Договор.Видимость = НЕ ЭтоКлиент;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	
	УстановитьЗаголовокИВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипКонтрагента) Тогда
		Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель");
	КонецЕсли;
	
	УстановитьЗаголовокИВидимость();
	
КонецПроцедуры


