Функция ПолучитьЗаписьЦеныНаКонкретнуюДату(Номенклатура, ВидЦены = Неопределено, ДатаЦены = Неопределено) Экспорт
	
	Если ДатаЦены = Неопределено Тогда
		ДатаЦены = ТекущаяДата();
	КонецЕсли;
	
	Если ВидЦены = Неопределено Тогда
		ВидЦены = ПредопределенноеЗначение("Перечисление.ВидыЦенПродажи.Розничная");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", ДатаЦены);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(Нстр("ru='В базе данных не найдены цены для данной номенклатуры!'"));
		Возврат 0;
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Цена;
	
КонецФункции