
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	СтрокаТипПолучателя = "";
	
	ЭтоВыдачаЗаработнойПлаты = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты"));
	ЭтоВыдачаПодотчетнику = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчётнику"));
	
	Если ЭтоВыдачаЗаработнойПлаты ИЛИ ЭтоВыдачаПодотчетнику Тогда
		СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
		Элементы.Договор.Видимость = Ложь;
	Иначе
		СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
		Элементы.Договор.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип(СтрокаТипПолучателя));
		
		ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
		Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
	КонецЕсли;
	
	Если Элементы.Договор.Видимость = Истина И ЗначениеЗаполнено(Объект.Получатель) Тогда
		 Элементы.Договор.Видимость = НЕ ПроверитьТипПолучателя(Объект.Получатель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьТипПолучателя(Получатель)
	
	ПолучательКлиент = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель,"ТипКонтрагента") = 
						ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент"));
	
	Возврат ПолучательКлиент
	
КонецФункции



