&НаКлиенте
Процедура ЗаполнитьНаименование()
	
	Если ЗначениеЗаполнено(Объект.Номер) И ЗначениеЗаполнено(Объект.ДатаНачала)Тогда
		Объект.Наименование = "№"+Объект.Номер+" от "+Объект.ДатаНачала;
	Иначе
		Объект.Наименование = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ДатаОкончания.Видимость = НЕ Объект.Бессрочный;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	ЗаполнитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ЗаполнитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	ЗаполнитьНаименование();
	
КонецПроцедуры








