
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЗаказыКлиентов.Записывать = Истина;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"Организация,Клиент,Ссылка,СуммаДокумента");
	
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.Период = Дата;
	Движение.Организация = ЗначенияРеквизитов.Организация;
	Движение.Клиент = ЗначенияРеквизитов.Клиент;
	Движение.ЗаказКлиента = ЗначенияРеквизитов.Ссылка;
	Движение.Сумма = ЗначенияРеквизитов.СуммаДокумента;
	
КонецПроцедуры
