&НаКлиенте
Процедура СформироватьФИО()
	
	Если ЗначениеЗаполнено(Объект.Фамилия) И ЗначениеЗаполнено(Объект.Имя) И ЗначениеЗаполнено(Объект.Отчество) Тогда
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	ИначеЕсли ЗначениеЗаполнено(Объект.Фамилия) И ЗначениеЗаполнено(Объект.Имя) И НЕ ЗначениеЗаполнено(Объект.Отчество) Тогда
		Объект.Наименование = Объект.Фамилия + " " + Объект.Имя;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Имя) ИЛИ НЕ ЗначениеЗаполнено(Объект.Фамилия) Тогда
		Объект.Наименование = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	СформироватьФИО();
	
КонецПроцедуры

 