&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	//Вызываем расчет сумм ТЧ и заполняем сумму документа
	РаботаСТЧ.ПересчитатьСуммуВСтрокеТЧ(Элементы.Товары.ТекущиеДанные);
	РаботаСТЧ.ЗаполнитьСуммуДокумента(Объект.Товары.Итог("Сумма"),Объект.Услуги.Итог("Сумма"),Объект.СуммаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	//Вызываем расчет сумм ТЧ и заполняем сумму документа
	РаботаСТЧ.ПересчитатьСуммуВСтрокеТЧ(Элементы.Товары.ТекущиеДанные);
	РаботаСТЧ.ЗаполнитьСуммуДокумента(Объект.Товары.Итог("Сумма"),Объект.Услуги.Итог("Сумма"),Объект.СуммаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	//Вызываем расчет сумм ТЧ и заполняем сумму документа
	РаботаСТЧ.ПересчитатьСуммуВСтрокеТЧ(Элементы.Услуги.ТекущиеДанные);
	РаботаСТЧ.ЗаполнитьСуммуДокумента(Объект.Товары.Итог("Сумма"),Объект.Услуги.Итог("Сумма"),Объект.СуммаДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	//Вызываем расчет сумм ТЧ и заполняем сумму документа
	РаботаСТЧ.ПересчитатьСуммуВСтрокеТЧ(Элементы.Услуги.ТекущиеДанные);
	РаботаСТЧ.ЗаполнитьСуммуДокумента(Объект.Товары.Итог("Сумма"),Объект.Услуги.Итог("Сумма"),Объект.СуммаДокумента);
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	//Заполняем ответственного через функцию БСП
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры











