
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Движения.ТоварыНаСкладах.Записать();
	Движения.УчетЗатрат.Записывать = Истина;
	Движения.Хозрасчетный.Записывать = Истина;
	
	ОрганизацияИПоставщикБСП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"Дата,Организация,Контрагент,Склад");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваров.Номенклатура КАК Товар,
	|	СУММА(ПоступлениеТоваров.Сумма) КАК Сумма,
	|	СУММА(ПоступлениеТоваров.Количество) КАК Количество
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваров.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеУслуг.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ПоступлениеУслуг.Сумма КАК СуммаУслуг,
	|	ПоступлениеУслуг.Услуга КАК Услуга
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК ПоступлениеУслуг
	|ГДЕ
	|	ПоступлениеУслуг.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(СуммаУслуг)
	|ПО
	|	СтатьяЗатрат";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СсылкаУслуги", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаТовары = РезультатЗапроса[0].Выбрать();
	
	ВыборкаУслуги = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаТовары.Следующий() Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ОрганизацияИПоставщикБСП.Дата;
		Движение.Организация = ОрганизацияИПоставщикБСП.Организация;
		Движение.Номенклатура = ВыборкаТовары.Товар;
		Движение.Склад = ОрганизацияИПоставщикБСП.Склад;
		Движение.Количество = ВыборкаТовары.Количество;
		Движение.Сумма = ВыборкаТовары.Сумма;
		
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.СчетДт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаТовары.Товар,"СчетБухгалтерскогоУчета");
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
		Движение.Период = ОрганизацияИПоставщикБСП.Дата;
		Движение.Сумма = ВыборкаТовары.Сумма;
		Движение.Содержание = "Отражено поступление товарно-материальных ценностей от поставщика";
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт,ВыборкаТовары.Товар);
		БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт,ОрганизацияИПоставщикБСП.Контрагент);
		
	КонецЦикла;
		
	Пока ВыборкаУслуги.Следующий() Цикл
		Движение = Движения.УчетЗатрат.Добавить();
		Движение.СтатьяЗатрат = ВыборкаУслуги.СтатьяЗатрат;
		Движение.Организация = ОрганизацияИПоставщикБСП.Организация;
		Движение.Период = ОрганизацияИПоставщикБСП.Дата;
		Движение.Сумма = ВыборкаУслуги.СуммаУслуг;
		
		ВыборкаДетальные = ВыборкаУслуги.Выбрать();
		
		Пока ВыборкаДетальные.Следующий() Цикл
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальные.Услуга,"СчетБухгалтерскогоУчета");
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
			Движение.Период = ОрганизацияИПоставщикБСП.Дата;
			Движение.Сумма = ВыборкаДетальные.СуммаУслуг;
			Движение.Содержание = "Отражено поступление услуг от поставщика";
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, ВыборкаДетальные.СтатьяЗатрат);
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, ОрганизацияИПоставщикБСП.Контрагент);
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры
