&НаСервере
Процедура УстановитьВидимостьИДлинуИНН()
	
	ЭтоЮрЛицо = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо"));
	Элементы.ГлавныйБухгалтер.Видимость = ЭтоЮрЛицо;
	Если ЗначениеЗаполнено(Объект.ИНН) Тогда
		Если ЭтоЮрЛицо И СтрДлина(Объект.ИНН) <> 10 Тогда
			ОбщегоНазначения.СообщитьПользователю(Нстр("ru='Число символов поля ИНН для Юр.лица должна составлять 10 символов!'"),,"Объект.ИНН");
			Отказ = Истина;
		ИначеЕсли НЕ ЭтоЮрЛицо И СтрДлина(Объект.ИНН) <> 12 Тогда
			ОбщегоНазначения.СообщитьПользователю(Нстр("ru='Число символов поля ИНН для ИП должна составлять 12 символов!'"),,"Объект.ИНН");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	УстановитьВидимостьИДлинуИНН();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	
	УстановитьВидимостьИДлинуИНН();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьИДлинуИНН();
	
КонецПроцедуры


